app/controllers/location_controller.rb

	def getAllStation
		@stations = Station.all
		@geolocations = Geolocation.joins(:station)
---
SELECT "stations".* FROM "stations"
SELECT "geolocations".* FROM "geolocations" INNER JOIN "stations" ON "stations"."id" = "geolocations"."station_id"
SELECT "stations".* FROM "stations" INNER JOIN "geolocations" ON "geolocations"."station_id" = "stations"."id"