app/controllers/prediction_controller.rb

SELECT  "postcodes".* FROM "postcodes" WHERE "postcodes"."postcode" = ?  ORDER BY "postcodes"."id" ASC LIMIT 1  [["postcode", 3000]]
SELECT  "single_readings".* FROM "single_readings" WHERE "single_readings"."station_id" = ?  ORDER BY "single_readings"."id" DESC LIMIT 50  [["station_id", 1]]
SELECT  "single_readings".* FROM "single_readings"  ORDER BY "single_readings"."id" DESC LIMIT 50
SELECT  "rainfalls".* FROM "rainfalls" WHERE "rainfalls"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "stations".* FROM "stations"  ORDER BY "stations"."id" ASC LIMIT 1
SELECT  "temperatures".* FROM "temperatures" WHERE "temperatures"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "winds".* FROM "winds" WHERE "winds"."id" = ? LIMIT 1  [["id", 1]]
---
    def getPostcodePrediction
        @postcode = params[:postcode].to_i
        @period = params[:period].to_i
        @station = Postcode.where(:postcode => @postcode).first.getRelevantStation
        @single_readings = SingleReading.where(:station_id => @station.id).last(50)
        temperature_array = Array.new
        rainfall_array = Array.new
        wind_speed_array = Array.new
        wind_direction_array = Array.new
        time_array = Array.new
        @single_readings.each do |sr|
            temperature_array.push(sr.temperature.temperature)
            rainfall_array.push(sr.rainfall.rainfall)
            wind_speed_array.push(sr.wind.windSpeed)
            wind_direction_array.push(sr.wind.windDirection)
            time_array.push((sr.time - @single_readings.first.time).to_i.abs / 60)

SELECT  "single_readings".* FROM "single_readings" WHERE "single_readings"."station_id" = ?  ORDER BY "single_readings"."id" DESC LIMIT 50  [["station_id", 2]]
SELECT  "rainfalls".* FROM "rainfalls" WHERE "rainfalls"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "temperatures".* FROM "temperatures" WHERE "temperatures"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "winds".* FROM "winds" WHERE "winds"."id" = ? LIMIT 1  [["id", 2]]
---
    def getGeolocationPrediction
        @geolocation = Geolocation.new
        @geolocation.latitude = params[:lat].to_f
        @geolocation.longitude = params[:long].to_f
        @period = params[:period].to_i
        @station = @geolocation.getRelevantStation
        @single_readings = SingleReading.where(:station_id => @station.id).last(50)
        temperature_array = Array.new
        rainfall_array = Array.new
        wind_speed_array = Array.new
        wind_direction_array = Array.new
        time_array = Array.new
        @single_readings.each do |sr|
            temperature_array.push(sr.temperature.temperature)
            rainfall_array.push(sr.rainfall.rainfall)
            wind_speed_array.push(sr.wind.windSpeed)
            wind_direction_array.push(sr.wind.windDirection)
            time_array.push((sr.time - @single_readings.first.time).to_i.abs / 60)