app/controllers/reading_controller.rb

SELECT  "stations".* FROM "stations" WHERE "stations"."stationID" = ?  ORDER BY "stations"."id" ASC LIMIT 1  [["stationID", "OLYM_PARK"]]
SELECT "single_readings".* FROM "single_readings" WHERE "single_readings"."station_id" = ? AND ("single_readings"."created_at" BETWEEN '2015-06-01 00:00:00.000000' AND '2015-06-01 23:59:59.999999')  [["station_id", 1]]
---
	def getLocationReading
		@date = Date.strptime(params[:date], "%d-%m-%Y")
		@station = Station.where(:stationID => params[:location_id]).first
		@single_readings = SingleReading.where(:station_id => @station.id, :created_at => (@date.beginning_of_day..@date.end_of_day))