app/controllers/weather_controller.rb

  def data
	@sources = Source.all
	@stations = Station.all
  	@readings = Reading.all
  	@single_readings = SingleReading.all

  	bom = Source.where(:name => "Bureau of Meteorology Australia").first
  	fio = Source.where(:name => "forecast.io").first

  	# Check latest reading
  	lastbom = Reading.where(:source_id => bom.id).order("created_at").last
  	lastfio = Reading.where(:source_id => fio.id).order("created_at").last

  	# Look at the whole table for matching reading.
  	@tablebom = SingleReading.joins(:station).where(:reading_id => lastbom.id)
---
SELECT  "sources".* FROM "sources" WHERE "sources"."name" = ?  ORDER BY "sources"."id" ASC LIMIT 1  [["name", "Bureau of Meteorology Australia"]]
SELECT  "readings".* FROM "readings" WHERE "readings"."source_id" = ?  ORDER BY created_at DESC LIMIT 1  [["source_id", 1]]
SELECT "single_readings".* FROM "single_readings" INNER JOIN "stations" ON "stations"."id" = "single_readings"."station_id" WHERE "single_readings"."reading_id" = ?  [["reading_id", 1]]